/**************** (C) COPYRIGHT 2018 青岛中特环保仪器有限公司 *******************
* 文 件 名:  
* 创 建 者:  Kaiser
* 描  述  :  
* 最后修改:  
*********************************** 修订记录 ************************************
* 版  本: 
* 修订人: 
********************************************************************************/
#include "BIOS.H"
/******************************** 功能说明 *************************************
*	
*******************************************************************************/
//SolenoidValve1_Cmd
//SolenoidValve2_Cmd
//SolenoidValve3_Cmd
void	Air_Charge_Valve( _Bool CMD )
{
	static	_Bool	State;
	if( State != CMD )
	{
		SolenoidValve1_Cmd( CMD );
		State = CMD;
	}
}

/******************************** 功能说明 *************************************
*	
*******************************************************************************/
void	Air_Bleed_Valve( _Bool CMD )
{
	static	_Bool	State;
	if( State != CMD )
	{
		SolenoidValve2_Cmd( CMD );
		State = CMD;
	}
}

/******************************** 功能说明 *************************************
*	
*******************************************************************************/
void	Injection_Water_Valve( _Bool CMD )
{
	static	_Bool	State;
	if( State != CMD )
	{
		SolenoidValve3_Cmd( CMD );
		State = CMD;
	}
}
/********  (C) COPYRIGHT 2018 青岛中特环保仪器有限公司  **** End Of File ********/
